docs/validation/extension-v4-independent/policy/artifacts/raw-sdk-admission-mutation.diff
diff --git a/packages/@ezcorp/sdk/src/v4/invocation-channel.ts b/packages/@ezcorp/sdk/src/v4/invocation-channel.ts
index fb2db328..8aef7a50 100644
--- a/packages/@ezcorp/sdk/src/v4/invocation-channel.ts
+++ b/packages/@ezcorp/sdk/src/v4/invocation-channel.ts
@@ -18,7 +18,6 @@ export async function withInvocationChannel<Result>(name: string, context: Exten
   function admit(method: string, params: unknown, propagateFailure = false): Promise<unknown> {
     check();
     const operation = context.call(method, params);
-    pending.push({ operation, propagateFailure });
     void operation.catch(() => {});
     return operation;
   }
