docs/validation/extension-v4-independent/policy/artifacts/raw-strict-sdk-gate-mutation.diff
diff --git a/scripts/test-coverage.sh b/scripts/test-coverage.sh
index 3cb114b9..7f6f63a7 100755
--- a/scripts/test-coverage.sh
+++ b/scripts/test-coverage.sh
@@ -1055,7 +1055,6 @@ if [ -n "$COVERAGE_LEGS_ONLY" ]; then
   # the exit status the cov-extras CI job reports.
   if [ "$SDK_LEG_EXIT" != "0" ]; then
     echo "::error::sdk coverage leg failed (exit $SDK_LEG_EXIT)"
-    exit 1
   fi
   if [ "$VITEST_EXIT" != "0" ] || [ "$HC_EXIT" != "0" ] || [ "$AIKIT_EXIT" != "0" ] || \
      [ "$LEG_LCOV_EXIT" != "0" ]; then exit 1; fi
